Tekla.Structures.ModelInternal.dotLoadClassAttributes_t
Serialization structure for LoadPoint.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.Position
The Position for the Load. Contains 1 -> n points, depending on the type of Load

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.P1
The P Vectors for the load.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.P2
The P Vectors for the load.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.P3
The P Vectors for the load.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.P4
The P Vectors for the load.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.Moment
The Moment Vector for the Load.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.Torsion1
Torsion 1.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.Torsion2
Torsion 2.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.DistanceA
Distance a.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.DistanceB
Distance b.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.LoadForm
Load Form type.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.TemperatureChangeForAxialElongation
Temperature change for axial elongation.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.TemperatureDifferentialTopToBottom
Temperature differential top to bottom.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.TemperatureDifferentialSideToSide
Temperature differential side to side.

Tekla.Structures.ModelInternal.dotLoadClassAttributes_t.InitialAxialElongation
Initial axial elongation.